class NumberOne:
    @staticmethod
    def number_one():
        x = [[10, 10, 10, 10, 10], [10, 10, 10, 10]]
        yA0 = 500
        yB0 = 500
        y = [[500, 500], [50, 50, 50], [50, 50], [25, 50]]
        total_details = [0, 0]
        yCA0 = 25
        yCB0 = 50
        Pa = 200
        Pb = 400
        D = [[5, 5, 5], [5, 5]]
        Dmax = 18
        Davg = 10
        Dmin = 2
        du = 0.02
        dt = 1
        a = 50

        for i in range(100):
            if not(y[0][0] < 0.05 * yA0):
                #Подсчеты верхней линии производства
                print('y[0][0] =', y[0][0])
                y[0][0] = y[0][0] + x[0][0] - x[0][1]
                y[1][0] = y[1][0] + x[0][1] - x[0][2]
                y[1][1] = y[1][1] + x[0][2] - x[0][3]
                y[1][2] = y[1][2] + x[0][3] - x[0][4]
                y[3][0] = y[3][0] + x[0][4]

                D[0][0] = Dmin + Davg * y[1][0] / D[0][0] + 50*du * Dmax
                D[0][1] = Dmin + Davg * y[1][1] / D[0][1] + 50*du * Dmax
                D[0][2] = Dmin + Davg * y[1][2] / D[0][2] + 50*du * Dmax

                print('D[0][0] =', D[0][0])
                print('D[0][1] =', D[0][1])
                print('D[0][2] =', D[0][2])

                x[0][2] = y[1][0] / D[0][0]
                x[0][3] = y[1][1] / D[0][1]
                x[0][4] = y[1][2] / D[0][2]

                print('x[0][2] =', x[0][2])
                print('x[0][3] =', x[0][3])
                print('x[0][4] =', x[0][4])

                if y[3][0] >= Pa:
                    total_details[0] += 1
                    y[3][0] -= Pa

            if (y[0][0] < 0.2 * yA0):
                y[0][0] += x[0][0]

            if not(y[0][1] < 0.05 * yB0):
                #Подсчеты нижней линии производства
                y[0][1] = y[0][1] + x[1][0] - x[1][1]
                y[2][0] = y[2][0] + x[1][1] - x[1][2]
                y[2][1] = y[2][1] + x[1][2] - x[1][3]
                y[3][1] = y[3][1] + x[1][3]

                D[1][0] = Dmin + Davg * y[2][0] / D[1][0] + 50 * du * Dmax
                D[1][1] = Dmin + Davg * y[2][1] / D[1][1] + 50 * du * Dmax

                x[1][2] = y[2][0] / D[1][0]
                x[1][3] = y[2][1] / D[1][1]

                if y[3][1] >= Pb:
                    total_details[1] += 1
                    y[3][1] -= Pb

            if (y[0][1] < 0.2 * yA0):
                y[0][1] += x[0][1]

        print(total_details)

class NumberTwo:
    pass

NumberOne.number_one()